Assembly was changed to a new type, but did not match the type. Geometry could have been changed due to a join condition.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AssemblyDidNotMatchRequestedTypeWarn { get; }
  Visual Basic
Public Shared ReadOnly Property AssemblyDidNotMatchRequestedTypeWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AssemblyDidNotMatchRequestedTypeWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AssemblyFailures Class
  Autodesk.Revit.DB Namespace